In [2]:
import pandas as pd

In [6]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df = pd.read_csv('example')

In [10]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
df.to_json()

'{"a":{"0":0,"1":4,"2":8,"3":12},"b":{"0":1,"1":5,"2":9,"3":13},"c":{"0":2,"1":6,"2":10,"3":14},"d":{"0":3,"1":7,"2":11,"3":15}}'

In [14]:
df.to_markdown()

'|    |   a |   b |   c |   d |\n|---:|----:|----:|----:|----:|\n|  0 |   0 |   1 |   2 |   3 |\n|  1 |   4 |   5 |   6 |   7 |\n|  2 |   8 |   9 |  10 |  11 |\n|  3 |  12 |  13 |  14 |  15 |'

In [38]:
df.to_csv("MY_output",index=False)

In [40]:
pd.read_csv("MY_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [51]:
pd.read_excel('Excel_Sample.xlsx',sheet_name="Sheet1")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [53]:
df.to_excel("Excel_Sample2.xlsx",sheet_name='NewSheet')

In [59]:
pd.read_excel('Excel_Sample2.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [63]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [69]:
type(df)

list

In [79]:
df[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
5,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
6,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
7,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
8,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
9,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536

In [89]:
from sqlalchemy import create_engine

In [93]:
engine = create_engine('sqlite:///:memory:')

AttributeError: 'list' object has no attribute 'to_sql'